_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ВыборУзловМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ВыборУзловМП</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>УзлыМП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:ExchangePlanRef.СМ_ОбменСметаМобильное</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ВыборУзловМП/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	ВыборкаУзлов = ПланыОбмена.СМ_ОбменСметаМобильное.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		Если ВыборкаУзлов.Ссылка =  ПланыОбмена.СМ_ОбменСметаМобильное.ЭтотУзел() ИЛИ ВыборкаУзлов.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		СтрМП = Объект.УзлыМП.Добавить();
		СтрМП.Узел = ВыборкаУзлов.Ссылка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Команда1(Команда)
	Список = Новый СписокЗначений;
	Для каждого стр Из Объект.УзлыМП Цикл
		Если Не стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Список.Добавить(стр.Узел);
	КонецЦикла;
	Закрыть(Список);
КонецПроцедуры

#КонецОбласти
